{"pageProps":{"note":{"id":"r6uu91l1zilit4nzpvs2gxo","title":"Pragmatism","desc":"","updated":1664126979690,"created":1664126971701,"description":"How to thrive in a world and workplace that are full of imperfections","custom":{"description":"How to thrive in a world and workplace that are full of imperfections"},"fname":"psychology.mindset.pragmatism","type":"note","vault":{"fsPath":".","selfContained":true,"name":"Content"},"contentHash":"06e939d666c4f4a43ba29e9527d1337d","links":[],"anchors":{"pragmatism-and-imperfectionism":{"type":"header","text":"Pragmatism and imperfectionism","value":"pragmatism-and-imperfectionism","line":9,"column":0,"depth":1},"contents":{"type":"header","text":"Contents","value":"contents","line":11,"column":0,"depth":2},"pragmatism":{"type":"header","text":"Pragmatism","value":"pragmatism","line":28,"column":0,"depth":2},"dont-expect-perfection":{"type":"header","text":"Don't expect perfection","value":"dont-expect-perfection","line":36,"column":0,"depth":2},"imperfectionist-mindset":{"type":"header","text":"Imperfectionist mindset","value":"imperfectionist-mindset","line":63,"column":0,"depth":2},"be-humble":{"type":"header","text":"Be humble","value":"be-humble","line":65,"column":0,"depth":3},"own-your-mistakes":{"type":"header","text":"Own your mistakes","value":"own-your-mistakes","line":73,"column":0,"depth":3},"focus-on-what-you-can-control":{"type":"header","text":"Focus on what you can control","value":"focus-on-what-you-can-control","line":90,"column":0,"depth":3},"focus-on-putting-in-the-work-rather-than-on-the-results":{"type":"header","text":"Focus on putting in the work rather than on the results","value":"focus-on-putting-in-the-work-rather-than-on-the-results","line":96,"column":0,"depth":3},"prefer-incremental-improvement-over-sudden-perfection":{"type":"header","text":"Prefer incremental improvement over sudden perfection","value":"prefer-incremental-improvement-over-sudden-perfection","line":103,"column":0,"depth":3},"consider-going-for-imperfect-action-now-instead-of-possibly-perfect-action-in-the-future":{"type":"header","text":"Consider going for imperfect action now instead of possibly perfect action in the future","value":"consider-going-for-imperfect-action-now-instead-of-possibly-perfect-action-in-the-future","line":119,"column":0,"depth":3},"focus-on-solutions-rather-than-problems":{"type":"header","text":"Focus on solutions rather than problems","value":"focus-on-solutions-rather-than-problems","line":128,"column":0,"depth":3},"make-success-easier-than-failure":{"type":"header","text":"Make success easier than failure","value":"make-success-easier-than-failure","line":148,"column":0,"depth":3},"resources":{"type":"header","text":"Resources","value":"resources","line":175,"column":0,"depth":2}},"children":[],"parent":"xir256kry6mojxxmm9ojw2t","data":{}},"body":"<h1 id=\"pragmatism\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#pragmatism\"></a>Pragmatism</h1>\n<h1 id=\"pragmatism-and-imperfectionism\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#pragmatism-and-imperfectionism\"></a>Pragmatism and imperfectionism</h1>\n<h2 id=\"contents\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#contents\"></a>Contents</h2>\n<ul>\n<li><a href=\"#pragmatism-and-imperfectionism\">Pragmatism and imperfectionism</a>\n<ul>\n<li><a href=\"#contents\">Contents</a></li>\n<li><a href=\"#pragmatism\">Pragmatism</a></li>\n<li><a href=\"#dont-expect-perfection\">Don't expect perfection</a></li>\n<li><a href=\"#imperfectionist-mindset\">Imperfectionist mindset</a>\n<ul>\n<li><a href=\"#be-humble\">Be humble</a></li>\n<li><a href=\"#own-your-mistakes\">Own your mistakes</a></li>\n<li><a href=\"#focus-on-what-you-can-control\">Focus on what you can control</a></li>\n<li><a href=\"#focus-on-putting-in-the-work-rather-than-on-the-results\">Focus on putting in the work rather than on the results</a></li>\n<li><a href=\"#prefer-incremental-improvement-over-sudden-perfection\">Prefer incremental improvement over sudden perfection</a></li>\n<li><a href=\"#consider-going-for-imperfect-action-now-instead-of-possibly-perfect-action-in-the-future\">Consider going for imperfect action now instead of possibly perfect action in the future</a></li>\n<li><a href=\"#focus-on-solutions-rather-than-problems\">Focus on solutions rather than problems</a></li>\n<li><a href=\"#make-success-easier-than-failure\">Make success easier than failure</a></li>\n</ul>\n</li>\n<li><a href=\"#resources\">Resources</a></li>\n</ul>\n</li>\n</ul>\n<h2 id=\"pragmatism-1\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#pragmatism-1\"></a>Pragmatism</h2>\n<ul>\n<li>Work in a way this is practical and sensible given the circumstances, even if it's different from the theoretical \"ideal way\"</li>\n<li>Focus on what actually gets the job done for your particular project and case, in a way that's good enough in your context</li>\n<li>One size doesn't fit all</li>\n<li>See also <a href=\"./It-depends.md\">It depends</a></li>\n<li>See also <a href=\"./Keep-it-simple.md\">Keep it simple</a></li>\n</ul>\n<h2 id=\"dont-expect-perfection\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#dont-expect-perfection\"></a>Don't expect perfection</h2>\n<p>Programming is hard and people are not perfect, so don't expect perfection.</p>\n<ul>\n<li>Don't expect perfection from <strong>yourself</strong>\n<ul>\n<li>Just like any other human, you are not perfect</li>\n<li>You will write code that is not bug-free</li>\n<li>You will write code that takes shortcuts, doesn't follow some of the project's conventions or is not clear about its intended purpose</li>\n<li>You will solve problems in suboptimal ways</li>\n<li>You will fail to see things that are obvious in hindsight</li>\n<li>You will lack knowledge on some topics that others know a lot more about and that maybe even seem like essential knowledge</li>\n<li>You will communicate in confusing ways or fail to communicate important information</li>\n<li>You will misunderstand your colleagues, even if what they say is sensible and clear</li>\n</ul>\n</li>\n<li>Don't expect perfection from your <strong>colleagues</strong>\n<ul>\n<li>Just like any other human, your colleagues are not perfect</li>\n<li>Everything that's listed above? Your colleagues will do that too.</li>\n</ul>\n</li>\n<li>Don't expect perfection from your <strong>codebase</strong>\n<ul>\n<li>Your codebase was likely written under time pressure and based on changing requirements, with everyone working on it an imperfect human</li>\n<li>There will be technical debt and not all of it will ever get fixed</li>\n<li>There will be things that don't make sense given the current situation but are impossible or impractical to change</li>\n</ul>\n</li>\n<li>Don't expect perfection from your <strong>process</strong>\n<ul>\n<li>There will be communication overhead and misunderstandings</li>\n<li>There will be unclear and changing requirements</li>\n<li>There will be situations where team members are blocking each other</li>\n<li>There will be situations where team members unknowingly perform duplicate or conflicting work</li>\n<li>There will be decisions that later turn out to be suboptimal because you didn't have the right info, knowledge, experience or priorities at the time</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"imperfectionist-mindset\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#imperfectionist-mindset\"></a>Imperfectionist mindset</h2>\n<h3 id=\"be-humble\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#be-humble\"></a>Be humble</h3>\n<ul>\n<li>Realize that you are imperfect, just like everyone around you\n<ul>\n<li>See also the previous section</li>\n</ul>\n</li>\n<li>Be open to feedback from others, as it is likely that you can learn something from them or they have noticed something you missed</li>\n<li>Embrace the fact that you can learn a lot from the people around you\n<ul>\n<li>There's no need to be the \"smartest person in the room\"</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"own-your-mistakes\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#own-your-mistakes\"></a>Own your mistakes</h3>\n<ul>\n<li>Since you are not perfect, it is expected that you make mistakes\n<ul>\n<li>Mistakes you make in <em>specific</em> situations do not imply that you are not good at what you do <em>in general</em></li>\n<li>It feels great to realize this and get comfortable admitting your mistakes</li>\n</ul>\n</li>\n<li>Rather than trying to hide your mistakes, admit them and give honest information about what happened\n<ul>\n<li>People who admit their mistakes come across as more confident, reliable and relatable than those who pretend to be perfect</li>\n<li>Bonus points if you already have ideas on how to solve the problem</li>\n<li>Bonus points if you can improve your process so the same mistake won't be able to happen again</li>\n</ul>\n</li>\n<li>Instead of ruminating about mistakes you have made, put that time and energy into fixing the situation or preventing the mistake from happening again</li>\n<li>If someone in the team makes a mistake, take responsibility as a team\n<ul>\n<li>Naming the person who made a mistake doesn't solve anything, and gives the impression that the team likes to blame individuals instead of taking responsibility</li>\n<li>Remember that everybody makes mistakes. If the process allowed for this mistake to happen, it was a matter of time before someone actually made the mistake, and it could easily have been someone else.</li>\n<li>Solve the issue as a team and improve your process as a team</li>\n</ul>\n</li>\n</ul>\n<p>Relevant article: <a href=\"https://meta.wikimedia.org/wiki/So_you%27ve_made_a_mistake_and_it%27s_public...\">So you've made a mistake and it's public...</a></p>\n<h3 id=\"focus-on-what-you-can-control\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#focus-on-what-you-can-control\"></a>Focus on what you can control</h3>\n<ul>\n<li>A lot of things are out of your control, meaning it's a waste of energy to stress out over them or try to change them</li>\n<li>Instead, focus on what you can control</li>\n<li>\"Don’t get stuck thinking that you can’t do good work unless something you can’t control changes\" (from <a href=\"https://hackernoon.com/three-growth-strategies-for-individual-contributors-kv4q3zgt\">Three Growth Strategies for Individual Contributors</a>)</li>\n</ul>\n<h3 id=\"focus-on-putting-in-the-work-rather-than-on-the-results\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#focus-on-putting-in-the-work-rather-than-on-the-results\"></a>Focus on putting in the work rather than on the results</h3>\n<ul>\n<li>Worrying about results steals time and energy that you could otherwise spend on putting in the actual work that is needed to get the results</li>\n<li>Reducing the pressure you put on yourself actually helps you perform your tasks more effectively</li>\n<li>Focusing less on results doesn't prevent you from getting the results you want, it just takes away the anxiety about not getting those results</li>\n<li>Note: This doesn't mean that there's no value in periodically evaluating whether your work generally gives you the kind of results you would expect to see. However, it does mean that there is no value in letting stress about results distract you from doing the work in the first place.</li>\n</ul>\n<h3 id=\"prefer-incremental-improvement-over-sudden-perfection\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#prefer-incremental-improvement-over-sudden-perfection\"></a>Prefer incremental improvement over sudden perfection</h3>\n<ul>\n<li>Focus on consistently making progress or adding value</li>\n<li>Start from the way things actually are, not from the way you wish they were</li>\n<li>Incremental improvement gives you early feedback on whether you're moving in the right direction\n<ul>\n<li>See also <a href=\"./Fail-fast.md\">Fail fast</a></li>\n</ul>\n</li>\n<li>Incremental improvement is often a lot more practical than sudden huge changes\n<ul>\n<li>Example: First writing a working \"first draft\" of the code and then improving its readability can be a lot more effective than trying to write perfectly clean code immediately\n<ul>\n<li>\"First make it work, then make it clean\"</li>\n</ul>\n</li>\n<li>Example: When introducing stricter coding standards to an existing project, changing all the existing code is often not practical or justifiable. But, if you apply the new standards whenever you write new code or touch an existing piece of code, all parts of the codebase that are under active development will soon follow the new standards</li>\n</ul>\n</li>\n<li>Big goals are daunting. Instead, break them into small steps and follow the process, focusing on one step at a time.</li>\n<li>There is often a compounding where early progress makes future progress easier\n<ul>\n<li>Example: Setting up basic automated linting makes it easy to add more strict/advanced rules later on</li>\n<li>Example: When learning, properly understanding basic concepts makes it a lot easier to understand more advanced concepts later on (<a href=\"./Concepts-not-code.md\">Concepts, not code</a>)</li>\n</ul>\n</li>\n<li>See also <a href=\"https://blog.stephsmith.io/how-to-be-great/\">How to Be Great? Just Be Good, Repeatably</a></li>\n</ul>\n<h3 id=\"consider-going-for-imperfect-action-now-instead-of-possibly-perfect-action-in-the-future\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#consider-going-for-imperfect-action-now-instead-of-possibly-perfect-action-in-the-future\"></a>Consider going for imperfect action now instead of possibly perfect action in the future</h3>\n<ul>\n<li>Taking a good enough action means improvement, not taking action means no improvement\n<ul>\n<li>\"Great is the enemy of good\"</li>\n<li>Good code shipped today is often better than perfect code shipped next week</li>\n</ul>\n</li>\n<li>Often, the experience you gain from taking action teaches you a lot more about what works well and what doesn't than just theorizing about what would be the best approach. See also <a href=\"https://blog.codinghorror.com/quantity-always-trumps-quality/\">Quantity Always Trumps Quality</a>\n<ul>\n<li>For creative problem solving, it might help to separate the process of creation from the process of analyzing what you created and improving. <em>\"You can’t write and edit, or sculpt and polish, or make and analyze at the same time. If you do, the editor stops the creator. While you invent, don’t select. While you sketch, don’t inspect. While you write the first draft, don’t reflect.\"</em> (<a href=\"https://kk.org/thetechnium/68-bits-of-unsolicited-advice/\">source</a>)</li>\n</ul>\n</li>\n<li>Definitely don't wait for perfect circumstances, as they will likely never come</li>\n</ul>\n<h3 id=\"focus-on-solutions-rather-than-problems\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#focus-on-solutions-rather-than-problems\"></a>Focus on solutions rather than problems</h3>\n<ul>\n<li>Software development is all about problem solving\n<ul>\n<li>Your real value is in delivering <em>solutions</em></li>\n</ul>\n</li>\n<li>Often, problems don't even need to be solved in order to make progress despite them\n<ul>\n<li>A lot of problems are not showstoppers</li>\n<li>In a lot of situations, a workaround or partial solution is enough</li>\n<li>Sometimes, it even makes sense to simply ignore the problem</li>\n</ul>\n</li>\n<li>Rather than focusing on the problem, focus on finding possible solutions or at least paths that lead towards possible solutions\n<ul>\n<li>Problems that seem unfixable at first sight are likely to be fixable once you really think about it</li>\n</ul>\n</li>\n<li>Looking at the big picture helps to find solutions or workarounds that may not be obvious if you focus too closely on the problem</li>\n<li>Note: All of this doesn't mean that you should start solving before you understand what the actual problem is!\n<ul>\n<li>See also <a href=\"./Keep-it-simple.md\">Keep it simple</a></li>\n</ul>\n</li>\n<li>Note: All of this doesn't mean that there is no value in identifying problems!\n<ul>\n<li>Typically, you need to identify a problem before you can solve it</li>\n<li>It can be very valuable to identify the main problems that are limiting your success</li>\n<li>Try to be a <em>Finder</em>, someone who identifies important problems and can also recognize if the team is solving the wrong problem because it's just a symptom of another more fundamental problem\n<ul>\n<li>See <a href=\"https://codewithoutrules.com/2018/10/10/beyond-senior-software-engineer/\">The next career step for Senior Software Engineers (that isn’t management)</a></li>\n</ul>\n</li>\n<li>However, once you've found a problem, start moving your focus to actually solving it rather than just getting stressed by its existence</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"make-success-easier-than-failure\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#make-success-easier-than-failure\"></a>Make success easier than failure</h3>\n<p>Basic idea:</p>\n<ul>\n<li>All humans tend to get lazy and take the easiest route\n<ul>\n<li>This is especially true if they're under some kind of time pressure</li>\n</ul>\n</li>\n<li>Use this to your advantage by making success easier than failure\n<ul>\n<li>Make it so easy to do the right thing that it would actually be <em>more</em> work to do the wrong thing</li>\n<li>If you want to create substantial and persistent change in the way people do things, you need to make sure that the \"right way\" to do something is also the easiest way for people to achieve their goals. Instead of forcing people to do something, you need to make them <em>want</em> to do it. Otherwise, they will always find a way around it.\n<ul>\n<li>Making the \"right way\" easier is often about tooling, but training can also have a large impact</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p>Examples:</p>\n<ul>\n<li>Productivity\n<ul>\n<li>Chop up your tasks until they're so small and well-defined that it's easier (and more fun) to start and complete them than to find excuses for avoiding them</li>\n</ul>\n</li>\n<li>Enforcing coding standards\n<ul>\n<li>Writing up a document with coding standards and then expecting the team to follow them through sheer discipline is not the ideal approach</li>\n<li>Automated formatting checks and linting make it easy to recognize and fix deviations from the standards</li>\n<li>Even better if everyone in the team has their IDE set up so all code is automatically formatted according to the standards whenever a file is saved</li>\n</ul>\n</li>\n<li>Making people write better PR descriptions\n<ul>\n<li>Can make success easier than failure by setting up a PR template where people just need to fill in the blanks\n<ul>\n<li>Can include description of changes, how to test things, ...</li>\n<li>Can also include a checklist (written/adjusted relevant tests, ensured backwards API compatibility, ...) that we want developers to go through before committing their PR</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Architectural governance\n<ul>\n<li>Want teams to do incremental rollouts instead of immediately applying new code to all instances or users? Foresee a deployment pipeline where that is the default behavior and where you need to jump through a few hoops to bypass the mechanism.</li>\n<li>Want developers to respect certain boundaries in your modular monolith? Enforce the boundaries programmatically and require thorough reviewing of any changes to the enforced rules.</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"resources\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#resources\"></a>Resources</h2>\n<ul>\n<li><a href=\"https://medium.com/gsoft-tech/pragmatic-software-development-59d12790e422\">Pragmatic Software Development</a></li>\n<li><a href=\"https://www.entrepreneur.com/article/232417\">3 Ways Owning Your Mistakes Will Make You Powerful</a></li>\n<li><a href=\"https://www.klipfolio.com/blog/own-your-mistakes\">Why you need to own your mistakes</a></li>\n<li><a href=\"https://workplace.stackexchange.com/questions/159311/how-to-professionally-acknowledge-to-a-client-that-a-former-coworker-made-a-mist\">How to professionally acknowledge to a client that a former coworker made a mistake in production?</a></li>\n<li>How to Be an Imperfectionist (book by Stephen Guise)</li>\n<li><a href=\"https://hackernoon.com/three-growth-strategies-for-individual-contributors-kv4q3zgt\">Three Growth Strategies for Individual Contributors</a></li>\n<li><a href=\"https://blog.stephsmith.io/how-to-be-great/\">How to Be Great? Just Be Good, Repeatably</a></li>\n<li><a href=\"https://blog.codinghorror.com/quantity-always-trumps-quality/\">Quantity Always Trumps Quality</a></li>\n<li><a href=\"https://kk.org/thetechnium/68-bits-of-unsolicited-advice/\">68 Bits of Unsolicited Advice</a></li>\n<li><a href=\"https://essays.jwatzman.org/essays/favourite-diff.html\">Favourite Diff</a></li>\n<li><a href=\"https://codewithoutrules.com/2018/10/10/beyond-senior-software-engineer/\">The next career step for Senior Software Engineers (that isn’t management)</a></li>\n<li><a href=\"http://rachelbythebay.com/w/2020/04/23/rel/\">Releasing software to the fleet far too quickly broke stuff</a> (<a href=\"https://news.ycombinator.com/item?id=22962830\">comments on Hacker News</a>)</li>\n</ul>","noteIndex":{"id":"root","title":"Content Vault","desc":"","updated":1662558369270,"created":1595961348801,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":".","selfContained":true,"name":"Content"},"contentHash":"cb55f68d3ce79e0822804b10f09ca3fd","links":[],"anchors":{},"children":["wtyu6q43n3szreaed4nh02w","pip8c7re5b98dmsnp8246pv","vopa3fjqdrvoi06csdfu2xe","rbyvu5swyse0uutc1vs0lws","aiudhlxwyv7av6axq2c8i32","49mwaxvc4aomvxmu7o83sur","qztqwcntrkonaglf5wxa85t","87gxpbo9z9nig8qg07ud7i6","cf9snv892lcy4co9oe0f3x4","dxwd5gga585h8x70d34wo05","iqi9yclrq5k7a937ipxyhww","55o3fpy3ms77quhs0vo8axx","cr393pxlptk9nfaz70u5z8k","trc6cw7vev5i3e5wrhjb6kz","5nrh3mcyrtfirk8u619rr6x","rh2ecrw9pbao4q56496qk4v","hqzwb36ii5mgxy2xww9yqy5","tj6u64qj0sdlusp7mt1p2hi"],"parent":null,"data":{},"body":"\nThis is the root for Content Vault\n\nMigration is \"In progress\"\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true,"enableSelfContainedVaults":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":".","selfContained":true,"name":"Content"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"task","dateFormat":"y.MM.dd","addBehavior":"asOwnDomain","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"taskCompleteStatus":["done","x"],"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link"},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"enableFullHierarchyNoteTitle":false,"enableSmartRefs":true},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableMermaid":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false},"publishing":{"siteUrl":"https://content.iamjacke.com","enableFMTitle":true,"enableNoteTitleForLink":true,"enableMermaid":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Stan's Content","description":"Stan's Personal Knowledge Space"},"github":{"enableEditLink":false,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","cname":"content.iamjacke.com"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"siteFaviconPath":"favicon.ico","siteIndex":"root","searchMode":"lookup"}}},"__N_SSG":true}